
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9940546518)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.cloudsql.google_sql_database.database
* Replace
  * module.gke.google_container_cluster.ga-cluster
  * module.gke.google_container_node_pool.default[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudsql.google_sql_database.database will be updated in-place
  ~ resource "google_sql_database" "database" {
      ~ charset         = "utf8mb3" -> "utf8"
      ~ collation       = "utf8mb3_general_ci" -> "utf8_general_ci"
        id              = "projects/grasys-study/instances/ga-terraform/databases/tasks"
        name            = "tasks"
        # (4 unchanged attributes hidden)
    }

  # module.gke.google_container_cluster.ga-cluster must be replaced
-/+ resource "google_container_cluster" "ga-cluster" {
      ~ cluster_ipv4_cidr           = "10.144.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      ~ enable_tpu                  = false -> (known after apply)
      ~ endpoint                    = "34.85.119.13" -> (known after apply)
      ~ id                          = "projects/grasys-study/locations/asia-northeast1/clusters/ga-gke" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.29.5-gke.1091002" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "ga-gke"
      ~ network                     = "projects/grasys-study/global/networks/ga-vpc" -> "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
      ~ node_version                = "1.29.5-gke.1091002" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1beta1/projects/grasys-study/locations/asia-northeast1/clusters/ga-gke" -> (known after apply)
      ~ services_ipv4_cidr          = "34.118.224.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/grasys-study/regions/asia-northeast1/subnetworks/ga-subnetwork" -> "https://www.googleapis.com/compute/v1/projects/grasys-study/regions/asia-northeast1/subnetworks/ga-subnetwork"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (14 unchanged attributes hidden)

      ~ addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          ~ gce_persistent_disk_csi_driver_config {
              ~ enabled = true -> (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcs_fuse_csi_driver_config {
              + enabled = (known after apply)
            }

          + gke_backup_agent_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          ~ network_policy_config {
              ~ disabled = true -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      - binary_authorization {
          - enabled = false -> null
        }

      ~ cluster_autoscaling {
            # (2 unchanged attributes hidden)

          ~ auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size         = 0 -> (known after apply)
              + disk_type         = (known after apply)
              ~ image_type        = "COS_CONTAINERD" -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                  - "https://www.googleapis.com/auth/service.management.readonly",
                  - "https://www.googleapis.com/auth/servicecontrol",
                  - "https://www.googleapis.com/auth/trace.append",
                ] -> (known after apply)
              ~ service_account   = "default" -> (known after apply)

              ~ management {
                  ~ auto_repair     = true -> (known after apply)
                  ~ auto_upgrade    = true -> (known after apply)
                  ~ upgrade_options = [
                      - {
                          - auto_upgrade_start_time = ""
                          - description             = ""
                        },
                    ] -> (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              ~ upgrade_settings {
                  ~ max_surge       = 0 -> (known after apply)
                  ~ max_unavailable = 0 -> (known after apply)
                  ~ strategy        = "SURGE" -> (known after apply)

                  + blue_green_settings {
                      + node_pool_soak_duration = (known after apply)

                      + standard_rollout_policy {
                          + batch_node_count    = (known after apply)
                          + batch_percentage    = (known after apply)
                          + batch_soak_duration = (known after apply)
                        }
                    }
                }
            }

          ~ resource_limits {
              ~ maximum       = 6 -> 12
              - minimum       = 1 -> null
                # (1 unchanged attribute hidden)
            }
          ~ resource_limits {
              ~ maximum       = 10 -> 16
              - minimum       = 0 -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ cluster_telemetry {
          ~ type = "ENABLED" -> (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + cost_management_config {
          + enabled = (known after apply)
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ default_snat_status {
          ~ disabled = false -> (known after apply)
        }

      + gateway_api_config {
          + channel = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.144.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-ga-gke-pods-ca825f0c" -> (known after apply)
          ~ services_ipv4_cidr_block      = "34.118.224.0/20" -> (known after apply)
          + services_secondary_range_name = (known after apply)
            # (1 unchanged attribute hidden)

          ~ pod_cidr_overprovision_config {
              ~ disabled = false -> (known after apply)
            }
        }

      ~ logging_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> (known after apply)
        }

      ~ maintenance_policy {
          ~ daily_maintenance_window {
              ~ duration   = "PT4H0M0S" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUs1WWlndDJJejFydXAzYXBZYmUvcEl3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09EbGpNVGMxTlRjdE16UTNOeTAwWm1ZMExXSmlaVGt0WmpFek0yWTBaVGRqWmpRMwpNQ0FYRFRJME1EY3hOVEV3TkRRek1Gb1lEekl3TlRRd056QTRNVEUwTkRNd1dqQXZNUzB3S3dZRFZRUURFeVE0Ck9XTXhOelUxTnkwek5EYzNMVFJtWmpRdFltSmxPUzFtTVRNelpqUmxOMk5tTkRjd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDaUxkSXNVY3RIbXhiNmlOT1BPZld0YXJXcFdvM2lZdXlsc0tXUAo4MEVoa2ZDYzFTNUIrUmpObGRHb3hjRk8ybVpyVUtNaUxHTHR0QzdURi9jRklhQUVyMDF5dFF3ZlJmZFBoeElyCisyaDF3dTNxc0J3YU1mQU0yS3MxTXdvUmNNZldvaHIvbGlRQkJFdG1OaG4xenVCUUtsTTdYUjZlSnB3Rlc3ZW8KZDVJeE9aVks2bVpYMGt3WWpjQWNQdzFlVW1uRnYvYnd4cmlrbFU0cmF4OTkvaERLM2cxOGxKc1o3S2U0UEhNZQpxRVE2bWp4eG51cmw2Mzc3d1V5Z3lKNzQ5SGNSbW5lYjNWTHRISnJEd3Nyc053VmpudkxJbEhYSUxvSWxzeHFxCjlZU2JQcDZvM28wNXZad2RJUkRlOC8vRExDaEgvSkRvMXdWVWs2S2RHU0pHSFFzQWZmcmM5Z2hiR3ZXa2hWMHoKdUZvRVhYN3VjcnRVTG5LTGZKbW01L1lqbEJxa25ETDJCM1g3NndwRXhiblNvWk9OZm5UYVRTSHpSZlhQdkxVVQpJVWhYTGNqc1hXMk9HOGZJOVMyVFkyVUlEeGVVSUdUNE1HWUp4ZDArSDZwbi9lbitEdWM3eDJzUFZKeVcwMVlmCkVQRFQvdmFmcG5rc3FYcU1kaUNSNWVKWUhNOENBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGTVo0UTlIQkx2MUkxc1crL0tBb29pcFk0bEoxTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQUlDRmRlYlNKRjYybkNyVjdDQ2ozbTJ5aXJ5bVNFNFRMWEsySTJNRTdHCklKOCtyTUtlckNoaEpCVG5Kek11bGI1a1dyeWM3WXd4cXlQbmFUMFRNV25kRWZadHVxUXZCcHdUdlRxSVE2UHMKcUxHTU03QlBBakJJS0VJWXQ5eE41bzRjdm9VbG1NR25xVk5Md2h4bmVRSWNBRXJPQVZuQ0dTTzBWV1pCejdOUgovVUsySk1MNmZiaTBRT2RjbG9ucGxBTUtLNGFNRnNCZUhJK2J6Y1JlVVlJa0dNL2RCVGE1R3cvWnBFNmVLTWRoCkQ3dUNkSVRDTjJ6ODRDVllqNTJ3a0MzeThqRmhpNlhSREc2VXZqZS9CMjNENHRhbitlQ05ud2hxUVF3eS9oOEwKVVdZOTdsdVJFUmZlWVB3T3QxREJmYW02ak5VbnMwRzVxNHk4WUQrZkZwNFZ4dUhwQ3VNK0JkUExPNU50OFhZdgpTYTk5UktPZDRhU3Q3UzhFWVYwc3JRVEF0b0s3REludVZVR2lVd0pnL0tpS0JBMUZJV25ncVRvR0EwU2ZRZUhNCkZsZmlZTC9QdUFVNldGWWJGRXpZejFWc21mMzZ3WEFWUXpvU0hVR2JZYlN5TGsrSHhhQTB2bWpFYmNaUlFmWEoKbkEra0lKV0tRTmpGSWpvZVNubXMvZ2s9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = false -> (known after apply)
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = (known after apply)
              + display_name = (known after apply)
            }
        }

      ~ monitoring_config {
          ~ enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> (known after apply)

          ~ advanced_datapath_observability_config {
              ~ enable_metrics = false -> (known after apply)
              + relay_mode     = (known after apply)
            }

          ~ managed_prometheus {
              ~ enabled = true -> (known after apply)
            }
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-small" -> "e2-standard-4" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "ga",
            ]
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          + confidential_nodes {
              + enabled = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count          = 1 -> (known after apply)
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-a/instanceGroupManagers/gke-ga-gke-default-pool-41c08144-grp",
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-b/instanceGroupManagers/gke-ga-gke-default-pool-afcff5ea-grp",
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-c/instanceGroupManagers/gke-ga-gke-default-pool-148397fe-grp",
            ] -> (known after apply)
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-a/instanceGroups/gke-ga-gke-default-pool-41c08144-grp",
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-b/instanceGroups/gke-ga-gke-default-pool-afcff5ea-grp",
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-c/instanceGroups/gke-ga-gke-default-pool-148397fe-grp",
            ] -> (known after apply)
          ~ max_pods_per_node           = 100 -> (known after apply)
          ~ name                        = "default-pool" -> (known after apply)
          + name_prefix                 = (known after apply)
          ~ node_count                  = 1 -> (known after apply)
          ~ node_locations              = [
              - "asia-northeast1-a",
              - "asia-northeast1-b",
              - "asia-northeast1-c",
            ] -> (known after apply)
          ~ version                     = "1.29.5-gke.1091002" -> (known after apply)

          + autoscaling {
              + location_policy      = (known after apply)
              + max_node_count       = (known after apply)
              + min_node_count       = (known after apply)
              + total_max_node_count = (known after apply)
              + total_min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ network_config {
              ~ create_pod_range     = false -> (known after apply)
              ~ enable_private_nodes = false -> (known after apply)
              ~ pod_ipv4_cidr_block  = "10.144.0.0/14" -> (known after apply)
              ~ pod_range            = "gke-ga-gke-pods-ca825f0c" -> (known after apply)

              + additional_node_network_configs {
                  + network    = (known after apply)
                  + subnetwork = (known after apply)
                }

              + additional_pod_network_configs {
                  + max_pods_per_node   = (known after apply)
                  + secondary_pod_range = (known after apply)
                  + subnetwork          = (known after apply)
                }

              + pod_cidr_overprovision_config {
                  + disabled = (known after apply)
                }
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 100 -> (known after apply)
              ~ disk_type         = "pd-balanced" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS_CONTAINERD" -> (known after apply)
              ~ labels            = {} -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ logging_variant   = "DEFAULT" -> (known after apply)
              ~ machine_type      = "e2-small" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                  - "https://www.googleapis.com/auth/service.management.readonly",
                  - "https://www.googleapis.com/auth/servicecontrol",
                  - "https://www.googleapis.com/auth/trace.append",
                ] -> (known after apply)
              ~ preemptible       = false -> (known after apply)
              ~ resource_labels   = {} -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ spot              = true -> (known after apply)
              ~ tags              = [
                  - "ga",
                ] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + advanced_machine_features {
                  + threads_per_core = (known after apply)
                }

              + confidential_nodes {
                  + enabled = (known after apply)
                }

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + ephemeral_storage_local_ssd_config {
                  + local_ssd_count = (known after apply)
                }

              + fast_socket {
                  + enabled = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + host_maintenance_policy {
                  + maintenance_interval = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                  + pod_pids_limit       = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + local_nvme_ssd_block_config {
                  + local_ssd_count = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              + sole_tenant_config {
                  + node_affinity {
                      + key      = (known after apply)
                      + operator = (known after apply)
                      + values   = (known after apply)
                    }
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + policy_name  = (known after apply)
              + tpu_topology = (known after apply)
              + type         = (known after apply)
            }

          ~ upgrade_settings {
              ~ max_surge       = 1 -> (known after apply)
              ~ max_unavailable = 0 -> (known after apply)
              ~ strategy        = "SURGE" -> (known after apply)

              + blue_green_settings {
                  + node_pool_soak_duration = (known after apply)

                  + standard_rollout_policy {
                      + batch_node_count    = (known after apply)
                      + batch_percentage    = (known after apply)
                      + batch_soak_duration = (known after apply)
                    }
                }
            }
        }
      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-a/instanceGroupManagers/gke-ga-gke-nodepool-01-e19be750-grp",
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-b/instanceGroupManagers/gke-ga-gke-nodepool-01-82a079b9-grp",
              - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-c/instanceGroupManagers/gke-ga-gke-nodepool-01-d0a4156e-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-a/instanceGroups/gke-ga-gke-nodepool-01-e19be750-grp",
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-b/instanceGroups/gke-ga-gke-nodepool-01-82a079b9-grp",
              - "https://www.googleapis.com/compute/beta/projects/grasys-study/zones/asia-northeast1-c/instanceGroups/gke-ga-gke-nodepool-01-d0a4156e-grp",
            ] -> null
          - max_pods_per_node           = 20 -> null
          - name                        = "nodepool-01" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "asia-northeast1-a",
              - "asia-northeast1-b",
              - "asia-northeast1-c",
            ] -> null
          - version                     = "1.29.5-gke.1091002" -> null

          - autoscaling {
              - location_policy      = "BALANCED" -> null
              - max_node_count       = 1 -> null
              - min_node_count       = 1 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
              - pod_ipv4_cidr_block  = "10.144.0.0/14" -> null
              - pod_range            = "gke-ga-gke-pods-ca825f0c" -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-medium" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                  - "https://www.googleapis.com/auth/service.management.readonly",
                  - "https://www.googleapis.com/auth/servicecontrol",
                  - "https://www.googleapis.com/auth/trace.append",
                ] -> null
              - preemptible       = false -> null
              - resource_labels   = {} -> null
              - service_account   = "default" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      + node_pool_auto_config {
          + network_tags {
              + tags = (known after apply)
            }
        }

      ~ node_pool_defaults {
          ~ node_config_defaults {
              ~ logging_variant = "DEFAULT" -> (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }
            }
        }

      - pod_security_policy_config {
          - enabled = false -> null
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.0.1.3" -> null
          - public_endpoint         = "34.85.119.13" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      ~ protect_config {
          ~ workload_vulnerability_mode = "WORKLOAD_VULNERABILITY_MODE_UNSPECIFIED" -> (known after apply)

          ~ workload_config {
              ~ audit_mode = "BASIC" -> (known after apply)
            }
        }

      ~ release_channel {
          ~ channel = "REGULAR" -> (known after apply)
        }

      ~ security_posture_config {
          ~ mode               = "BASIC" -> (known after apply)
          ~ vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> (known after apply)
        }

      ~ service_external_ips_config {
          ~ enabled = false -> (known after apply)
        }

      + tpu_config {
          + enabled                = (known after apply)
          + ipv4_cidr_block        = (known after apply)
          + use_service_networking = (known after apply)
        }

      ~ workload_identity_config {
          + workload_pool = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.default[0] must be replaced
-/+ resource "google_container_node_pool" "default" {
      ~ cluster                     = "projects/grasys-study/locations/asia-northeast1/clusters/ga-gke" -> (known after apply) # forces replacement
      ~ id                          = "projects/grasys-study/locations/asia-northeast1/clusters/ga-gke/nodePools/nodepool-01" -> (known after apply)
      ~ initial_node_count          = 1 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-a/instanceGroupManagers/gke-ga-gke-nodepool-01-e19be750-grp",
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-b/instanceGroupManagers/gke-ga-gke-nodepool-01-82a079b9-grp",
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-c/instanceGroupManagers/gke-ga-gke-nodepool-01-d0a4156e-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-a/instanceGroups/gke-ga-gke-nodepool-01-e19be750-grp",
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-b/instanceGroups/gke-ga-gke-nodepool-01-82a079b9-grp",
          - "https://www.googleapis.com/compute/v1/projects/grasys-study/zones/asia-northeast1-c/instanceGroups/gke-ga-gke-nodepool-01-d0a4156e-grp",
        ] -> (known after apply)
        name                        = "nodepool-01"
      + name_prefix                 = (known after apply)
      ~ node_locations              = [
          - "asia-northeast1-a",
          - "asia-northeast1-b",
          - "asia-northeast1-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.29.5-gke.1091002" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ network_config {
          ~ create_pod_range     = false -> (known after apply)
          ~ enable_private_nodes = false -> (known after apply)
          ~ pod_ipv4_cidr_block  = "10.144.0.0/14" -> (known after apply)
          ~ pod_range            = "gke-ga-gke-pods-ca825f0c" -> (known after apply)

          + network_performance_config {
              + total_egress_bandwidth_tier = (known after apply)
            }

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      ~ node_config {
          + boot_disk_kms_key           = (known after apply)
          ~ disk_size_gb                = 100 -> (known after apply)
          ~ disk_type                   = "pd-balanced" -> (known after apply)
          ~ effective_taints            = [] -> (known after apply)
          ~ enable_confidential_storage = false -> (known after apply)
          ~ guest_accelerator           = [] -> (known after apply)
          ~ image_type                  = "COS_CONTAINERD" -> (known after apply)
          ~ labels                      = {} -> (known after apply)
          ~ local_ssd_count             = 0 -> (known after apply)
          ~ logging_variant             = "DEFAULT" -> (known after apply)
          ~ machine_type                = "e2-medium" -> (known after apply)
          ~ metadata                    = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform            = (known after apply)
          + node_group                  = (known after apply)
          ~ oauth_scopes                = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ resource_labels             = {} -> (known after apply)
          ~ resource_manager_tags       = {} -> (known after apply)
          ~ service_account             = "default" -> (known after apply)
          ~ spot                        = false -> (known after apply)
          ~ tags                        = [] -> (known after apply)

          + advanced_machine_features {
              + enable_nested_virtualization = (known after apply)
              + threads_per_core             = (known after apply)
            }

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + containerd_config {
              + private_registry_access_config {
                  + enabled = (known after apply)

                  + certificate_authority_domain_config {
                      + fqdns = (known after apply)

                      + gcp_secret_manager_certificate_config {
                          + secret_uri = (known after apply)
                        }
                    }
                }
            }

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = (known after apply)
            }

          + fast_socket {
              + enabled = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + host_maintenance_policy {
              + maintenance_interval = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
              + pod_pids_limit       = (known after apply)
            }

          + linux_node_config {
              + cgroup_mode = (known after apply)
              + sysctls     = (known after apply)
            }

          + local_nvme_ssd_block_config {
              + local_ssd_count = (known after apply)
            }

          + reservation_affinity {
              + consume_reservation_type = (known after apply)
              + key                      = (known after apply)
              + values                   = (known after apply)
            }

          + secondary_boot_disks {
              + disk_image = (known after apply)
              + mode       = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + sole_tenant_config {
              + node_affinity {
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + values   = (known after apply)
                }
            }

          + taint {
              + effect = (known after apply)
              + key    = (known after apply)
              + value  = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
          ~ strategy        = "SURGE" -> (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":30,"Program":"tfcmt","SHA1":"f593acc46fa3687a9d2a8af43ebf04cb1ef9832c","Vars":{},"WorkflowName":"terraform plan"} -->